Repository: 84000/data-translation-memory
Catalog: toh556-v3.tmx
Source language: bo
Languages: en

source: འདུས་བྱས་ཀྱི་ཆོས་ཐམས་ཅད་ནི་བགྲང་ཞིང་དཔག་ཏུ་ཡོད་ལ། འདུས་མ་བྱས་ཀྱི་ཆོས་ནི་བགྲང་ཞིང་དཔག་པ་ཐམས་ཅད་དང་བྲལ་བ་སྟེ།
en: “Ninth, all composite phenomena have a number and measure, but noncomposite phenomena are devoid of all number and measure.

source: སངས་རྒྱས་ཀྱིས་འདུས་བྱས་ཀྱི་ཆོས་སྤངས་ཤིང་། འདུས་མ་བྱས་ཀྱི་ཆོས་མངོན་དུ་མཛད་དེ། བགྲང་བ་དང་དཔག་པ་མི་མངའ་བས་དེའི་ཕྱིར། མྱ་ངན་ལས་འདས་པ་ཞེས་བྱ་བ་དང་།
en: The buddhas have rejected composite phenomena and manifested noncomposite qualities, and so they have no number or measure; therefore, this is called nirvāṇa.

source: དེ་བཞིན་གཤེགས་པས་སེམས་ཅན་དང་། ཆོས་ཀྱི་རང་བཞིན་ཀུན་སྟོང་པ་དང་། སྟོང་པ་དེ་ལས་གཞན་པ་ལའང་ཡོད་པ་མ་ཡིན་པ་དང་། སྟོང་པའི་རང་བཞིན་དེ་ཉིད་ཡང་དག་པའི་ཆོས་ཀྱི་སྐུ་ཡིན་པས་དེའི་ཕྱིར།
en: “Tenth, the tathāgatas know that the nature of all beings and phenomena is empty, and they know there is nothing that exists that is other than that emptiness, and that the nature of that emptiness is the true Dharma body.

source: དེ་ལ་མྱ་ངན་ལས་འདས་པ་ཞེས་བྱ་སྟེ།
en: Therefore, this is called nirvāṇa.

source: རིགས་ཀྱི་བུ་ཆོས་བཅུ་པོ་དེ་དག་གིས་ནི་མྱ་ངན་ལས་འདས་པ་ཞེས་བྱའོ། །
en: “Noble one, it is through those ten qualities that there is what is called nirvāṇa.

source: གཞན་ཡང་རིགས་ཀྱི་བུ་དེ་བཞིན་གཤེགས་པ་མྱ་ངན་ལས་མི་འདའ་བ་དེ་འབའ་ཞིག་ངོ་མཚར་ཆེ་བ་མ་ཡིན་གྱིས།
en: “Also, noble one, the fact that the tathāgatas do not pass into nirvāṇa is not the only marvel.

source: གཞན་ཡང་ངོ་མཚར་དུ་བྱ་བ་ཆོས་རྣམ་པ་བཅུ་ཡོད་པ།
en: There are ten other qualities that are called marvelous.

source: དེ་ནི་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་སྤྱོད་པའོ། །
en: They are the conduct of the tathāgatas.

source: འཁོར་བ་ནི་སྐྱོན་དང་ལྡན་པ་མྱ་ངན་ལས་འདས་པ་ནི་ཞི་ཞིང་དབེན་པ་ཡིན་ན།
en: “First, saṃsāra has defects; nirvāṇa is peace and withdrawal.

source: འཁོར་བ་དང་མྱ་ངན་ལས་འདས་པ་དེ་གཉིས་མཉམ་པར་མཁྱེན་པས། འཁོར་བ་ལ་ཡང་མི་གནས། མྱ་ངན་ལས་འདས་པ་ལ་ཡང་མི་བཞུགས་ཤིང་།
en: Through knowing that saṃsāra and nirvāṇa are the same, they do not remain in saṃsāra and do not dwell in nirvāṇa.

source: གང་སེམས་ཅན་རྣམས་ཀྱི་དོན་ལ་མི་སྐྱོ་བ་དེ་ནི། དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་སྤྱོད་པའོ། །
en: Not wearying of benefiting beings is the conduct of the tathāgatas.

source: དེ་བཞིན་གཤེགས་པས་བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་ཕྱིན་ཅི་ལོག་ཏུ་སྤྱོད་པ་དང་། ཉོན་མོངས་པ་སྣ་ཚོགས་ཀྱིས་གླགས་པར་གཟིགས་ཀྱང་འདི་དག་རྣམ་པར་གྲོལ་བར་བྱའོ། །སྙམ་དུ་མི་དགོངས་མོད་ཀྱི།
en: “Second, even though the tathāgatas see the incorrect conduct of foolish ordinary beings and that they are overcome by various kleśas, they do not think, ‘I will liberate these beings.’

source: སྔོན་གྱི་ཐུགས་རྗེ་དང་། དགེ་བའི་རྩ་བའི་མཐུས་སེམས་ཅན་འདི་དག་སོ་སོའི་དབང་པོ་དང་། རང་བཞིན་ཅན་དང་། བསམ་པ་ཅི་ལ་མོས་པ་རྟོག་པ་མི་མངའ་བར་ལྷུན་གྱིས་གྲུབ་པའི་ཚུལ་གྱིས། ཕྱི་མའི་མཐར་ཐུག་པ་མེད་པར་ཕན་འདོགས་ཤིང་།
en: Instead, through the power of their previous compassion and roots of merit, without thoughts concerning the individual faculties, natures, wishes, or aspirations of beings, they spontaneously benefit and teach them throughout the endless future.

source: སྟོན་པ་དེ་ནི་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་སྤྱོད་པའོ། །
en: That is the conduct of the tathāgatas.

source: དེ་བཞིན་གཤེགས་པས་སེམས་ཅན་རྣམས་ལ་གསུང་རབ་ཡན་ལག་བཅུ་གཉིས་རྒྱས་པར་བསྟན་པས། ཕན་གདགས་སོ་སྙམ་དུ་མི་དགོངས་མོད་ཀྱི། སྔོན་གྱི་ཐུགས་རྗེ་དང་། དགེ་བའི་རྩ་བའི་མཐུས་སེམས་ཅན་འདི་དག་ལ་ཕྱི་མའི་མཐར་ཐུག་པ་མེད་པར་ཆོས་རྒྱས་པར་སྟོན་པ་དེ་ནི།
en: “Third, even though the tathāgatas do not think, ‘I will benefit beings by teaching them extensively through the twelve forms of the teaching,’ through the power of their previous compassion and roots of merit they teach them extensively throughout the endless future.

source: དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་སྤྱོད་པའོ། །དེ་བཞིན་གཤེགས་པ་གྲོང་དང་། གྲོང་ཁྱེར་དང་།
en: That is the conduct of the tathāgatas.

source: གྲོང་འདབ་ཏུ་གཤེགས་ཤིང་། རྒྱལ་པོ་དང་། བློན་པོ་དང་། བྲམ་ཟེ་དང་། རྒྱལ་རིགས་དང་། རྗེའུ་རིགས་དང་། དམངས་རིགས་ལ་སོགས་པའི་ཁྱིམ་དུ་བསོད་སྙོམས་བླང་ངོ་སྙམ་དུ་མི་དགོངས་མོད་ཀྱི། སྔོན་གྱི་སྐུ་དང་། གསུང་དང་། ཐུགས་ཀྱི་སྤྱོད་པ་ལ་གོམས་པའི་མཐུས། ལྷུན་གྱིས་གྲུབ་པར་བསོད་སྙོམས་ལ་གཤེགས་ཤིང་ཕན་པའི་དོན་མཛད་པ་དེ་ནི།
en: “Fourth, even though the tathāgatas do not think, ‘I will go to the villages, towns, and outlying areas of towns to obtain alms from the homes of the kings, ministers, brahmins, kṣatriyas, vaiśyas, śūdras, and so on,’ through the power of previous habituation to conduct of body, speech, and mind, they spontaneously go to receive alms and accomplish the goal of benefiting others.

source: དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་སྤྱོད་པའོ། །དེ་བཞིན་གཤེགས་པའི་སྐུ་ལ་སྦྲེབས་པ་དང་སྐྱེམས་པ་ཡང་མི་མངའ། བཤང་གཅི་དང་།
en: That is the conduct of the tathāgatas.

source: སྐུ་ཉམ་ཆུང་བ་ཡང་མི་མངའ་བར་བསོད་སྙོམས་ལེན་པར་སྣང་ཡང་། དེ་ལ་གསོལ་བ་ཡང་མེད། དེའི་རྣམ་པར་རྟོག་པ་ཡང་མི་མངའ་མོད་ཀྱི། སེམས་ཅན་ལ་ཕན་གདགས་པའི་ཕྱིར།
en: “Fifth, the bodies of the tathāgatas have no hunger or thirst, no feces or urine, and no physical weakness; and, although they appear to receive alms, they do not consume them, and have no such thought, but in order to benefit beings they appear to consume alms.

source: བསོད་སྙོམས་གསོལ་བར་ཡང་སྣང་བ་དེ་ནི། དེ་བཞིན་གཤེགས་པའི་སྤྱོད་པ་ལྷུན་གྱིས་གྲུབ་པའོ། །
en: That is the spontaneous conduct of the tathāgatas.

source: གང་དེ་བཞིན་གཤེགས་པས་སེམས་ཅན་འདི་དག་གི་དབང་པོ་རབ་དང་། འབྲིང་དང་། ཐ་མ་ཇི་ལྟ་བ་བཞིན་དུ་ཆོས་བསྟན་ཏོ་སྙམ་དུ་མི་དགོངས་མོད་ཀྱི། སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཀྱིས་སོ་སོའི་དབང་པོ་དང་སྣོད་ཇི་ལྟ་བུ་ཡིན་པ་རྟོག་པ་མི་མངའ་བར་རབ་ཏུ་མཁྱེན་ཅིང་།
en: “Sixth, even though the tathāgatas do not think, ‘I will teach the Dharma according to the higher, medium, and lesser capabilities of these beings,’ they teach the Dharma, knowing without thought what the individual capabilities and capacities are.

source: དེ་དག་ལ་ཆོས་སྟོན་པ་དེ་ནི་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་སྤྱོད་པའོ། །
en: That is the conduct of the tathāgatas.

source: དེ་བཞིན་གཤེགས་པས་སེམས་ཅན་འདི་དག་ནི། གུས་པ་མེད་པ་རྟག་ཏུ་ཚིག་རྩུབ་པོས་ངན་དུ་སྨྲ་བ་ཡིན་པས།
en: “Seventh, the tathāgatas do not think, ‘These beings have no reverence and always speak badly, using harsh words, and so I will not speak with them.’

source: འདི་དག་དང་། ལྷན་ཅིག་མི་སྨྲའོ། །སེམས་ཅན་འདི་དག་ནི་ང་ལ་རྟག་ཏུ་གུས་པར་བྱེད་པ། བསྟོད་ཅིང་སྙན་པར་སྨྲ་བ་ཡིན་པས། འདི་དག་དང་ལྷན་ཅིག་སྨྲ་བར་བྱའོ་ཞེས་དེ་བཞིན་གཤེགས་པ་མི་དགོངས་ཏེ།
en: And they do not think, ‘These beings are always reverential toward me, praise me, and speak pleasantly to me, and so I will speak with them.’

source: བྱམས་པ་དང་།
en: Instead, they regard them all equally with compassion.

source: ཐུགས་རྗེས་མཉམ་པར་དགོངས་ཤིང་གཉིས་སུ་མེད་པ་དེ་ནི་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་སྤྱོད་པའོ། །
en: That nonduality is the conduct of the tathāgatas.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ལ་བྱམས་སྡང་དང་། ང་རྒྱལ་དང་། འདོད་པ་དང་། སེར་སྣ་ལ་སོགས་པའི་ཉོན་མོངས་པ་མི་མངའ་མོད་ཀྱི། དེ་བཞིན་གཤེགས་པ་ནི་རྟག་པར་དབེན་པ་ལ་དགྱེས་ཤིང་།
en: “Eighth, the buddha bhagavats do not have the kleśas of love and hate, pride, desire, avarice, and so on, but instead they always praise delighting in solitude, avoiding all crowds, and having little desire.

source: འདུ་འཛི་ཐམས་ཅད་སྤངས་ཏེ། འདོད་པ་ཆུང་བ་ལ་བསྔགས་པ་མཛད་པ་དེ་ནི་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་སྤྱོད་པའོ། །
en: That is the conduct of the tathāgatas.

source: དེ་བཞིན་གཤེགས་པ་ནི་ཆོས་འགའ་ཙམ་ཡང་མི་མཁྱེན་པའམ། ཐུགས་སུ་མ་ཆུད་པ་མི་མངའ་བ་དང་། གནས་ཐམས་ཅད་དུ་མེ་ལོང་ལྟ་བུའི་ཡེ་ཤེས་མངོན་དུ་གྱུར་པས།
en: “Ninth, the tathāgatas have no knowledge or comprehension of any phenomena whatsoever, but instead they have wisdom that is like a mirror in which everything manifests.

source: རྣམ་པར་མི་རྟོག་མོད་ཀྱི། དེ་བཞིན་གཤེགས་པས་སེམས་ཅན་འདི་དག་གི་ལས་དང་སྤྱོད་པ་ལ་གཟིགས་ནས། དེ་དག་གི་བསམ་པ་དང་མཐུན་པར་སྦྱོར་བས།
en: Even though the tathāgatas therefore have no thoughts, they nevertheless see the actions and conduct of beings and engage with them in accord with their aspirations, employ methods to lead them, and liberate them from saṃsāra.

source: ཐབས་ཀྱིས་འདྲེན་ཅིང་འཁོར་བ་ལས་སྒྲོལ་བ་དེ་ནི་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་སྤྱོད་པའོ། །
en: That is the conduct of the tathāgatas.

source: དེ་བཞིན་གཤེགས་པས་སེམས་ཅན་གང་དག་ཕྱུག་ཅིང་དར་བ་གཟིགས་ན་ཡང་དགྱེས་པ་མི་སྐྱེ། རྒུད་པ་དང་དམའ་བ་གཟིགས་ན་ཡང་ཐུགས་ངལ་མི་མཛད་མོད་ཀྱི།
en: “Tenth, the tathāgatas do not delight in seeing beings becoming wealthy and prospering, and they do not become distressed when they see beings deteriorating and worsening.

source: དེ་བཞིན་གཤེགས་པ་སེམས་ཅན་དེ་དག་ཡང་དག་པའི་སྤྱོད་པ་སྒྲུབ་པ་གཟིགས་ནས། ཐོགས་པ་མེད་པའི་ཐུགས་རྗེ་ཆེན་པོས་སྐྱོབ་པར་མཛད་དོ། །སེམས་ཅན་ལ་ལ་ལོག་པར་སྤྱོད་པ་གཟིགས་ན་ཡང་། ཆགས་པ་མེད་པའི་ཐུགས་རྗེ་ཆེན་པོས་སྐྱོབ་ཅིང་འཛིན་པ་དེ་ནི་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་སྤྱོད་པའོ། །
en: Nevertheless, the tathāgatas protect with unimpeded compassion those beings they see accomplishing correct conduct, and although they see beings with incorrect conduct, they protect and care for them with a great compassion that is without attachment.

source: རིགས་ཀྱི་བུ་འདི་ནི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཀྱི་ཡང་དག་པའི་སྤྱོད་པ་མཐའ་མེད་པར་བསྟན་པ་དང་།
en: That is the conduct of the tathāgatas.

source: མྱ་ངན་ལས་འདས་པ་ཡང་དག་པ་བདེན་པའི་མཚན་ཉིད་དུ་འདུ་ཤེས་པར་གྱིས་ཤིག །
en: “Noble one, understand the infinite manifestation of the valid conduct of the tathāgata arhat samyaksaṃbuddhas and the quality of valid truth of their nirvāṇas.

source: སྐབས་གཞན་དག་ཏུ་མྱ་ངན་ལས་འདའ་བ་དང་། རིང་བསྲེལ་འཇིག་རྟེན་དུ་བཞག་ཅེས་བྱ་བ་དེ་ནི་ཐབས་མཁས་པ་བསྟན་པ་སྟེ།
en: When, in other times, it is said, ‘They pass into nirvāṇa and leave relics in the world,’ view that as the manifestation of a skillful method.

source: སེམས་ཅན་རྣམས་ཀྱི་མཆོད་པ་དང་། རིམ་གྲོ་བྱེད་པ་དེ་དག་ཀྱང་དེ་བཞིན་གཤེགས་པའི་ཐུགས་རྗེ་དང་དགེ་བའི་རྩ་བའི་མཐུ་ཡིན་པར་བལྟ་བར་བྱའོ། །དེ་ལ་གང་ཞིག་མཆོད་པ་དང་། རིམ་གྲོ་བྱེད་པ་དེ་ནི། མ་འོངས་པའི་དུས་ན།
en: Consider that it is through the power of the compassion and good roots of the tathāgatas that beings are able to make offerings to relics and revere them.

source: མི་ཁོམ་པ་བརྒྱད་ཡོངས་སུ་སྤངས་ཏེ། དེ་བཞིན་གཤེགས་པ་རྣམས་དང་ཕྲད་ཅིང་། དགེ་བའི་བཤེས་གཉེན་དང་ལྡན་པ་དང་། བྱང་ཆུབ་ཀྱི་སེམས་མི་གཏོང་བ་དང་། བསོད་ནམས་དཔག་ཏུ་མེད་པ་འཕེལ་བ་དང་།
en: “Someone who makes an offering to the relics and reveres them will, in a future time, become free of the eight unfavorable states, will meet the tathāgatas, will have a kalyāṇamitra, will not abandon the enlightenment mind, will increase their merit immeasurably, will quickly transcend saṃsāra, and will not be overcome by the bondage of saṃsāra.

source: འཁོར་བ་ལས་མྱུར་དུ་འདའ་ཞིང་འཁོར་བའི་འཆིང་བས་གླགས་པར་མི་འགྱུར་བའི་སྤྱོད་པ་དམ་པ་འདི་ཡིན་པས། ཁྱེད་ཀྱིས་ནན་ཏན་དུ་བསྒྲུབ་ཅིང་གཡེལ་བ་མེད་པར་བྱའོ། །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་མཛེས་པའི་ཏོག་གིས།
en: That is sublime conduct and therefore you should earnestly accomplish it without distraction.”

source: བཅོམ་ལྡན་འདས་མྱ་ངན་ལས་མི་འདའ་བའི་དོན་དང་། བཟོད་པ་ཟབ་མོ་བསྟན་པ། བཅོམ་ལྡན་འདས་ལ་མངོན་དུ་ཐོས་ནས། ཐལ་མོ་སྦྱར་བ་བཏུད་དེ། འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: The bodhisattva Ruciraketu, having heard from the Bhagavat the meaning of the Bhagavat’s not passing into nirvāṇa and his teaching of profound deeds, placed his palms together in homage and bowed down to him.

source: དེང་གཟོད་བདག་གིས་དེ་བཞིན་གཤེགས་པ་སྟོན་པ་ཆེན་པོ་མྱ་ངན་ལས་མི་འདའ་བ་དང་། རིང་བསྲེལ་འཇིག་རྟེན་དུ་བཞག་ཅིང་། སེམས་ཅན་རྣམས་ལ་ཕན་པ་རྒྱ་ཆེར་མཛད་པ། འདི་འཚལ་བར་གྱུར་ནས། ལུས་དང་སེམས་དགའ་ཞིང་རངས་པ་ངོ་མཚར་དུ་གྱུར་ཏོ། །
en: He said, “Having on this day been taught that the Tathāgata, the Great Teacher, does not pass into nirvāṇa and that he creates great benefit for beings through leaving relics in the world, I am joyful, delighted, and amazed in body and mind.”

source: དེ་བཞིན་གཤེགས་པའི་སྐུ་ཚེའི་ཚད་འདི་བསྟན་པ་ན། གྲངས་མེད་དཔག་ཏུ་མེད་ཅིང་མཐའ་ཡས་པའི་སེམས་ཅན་དེ་དག་ཐམས་ཅད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་སྐྱེས་སོ། །
en: When this teaching on the lifespan of the tathāgatas was given, all those innumerable, countless beings developed the aspiration for the highest, most complete enlightenment.

source: དེ་བཞིན་གཤེགས་པ་དེ་དག་ཀྱང་མི་སྣང་བར་གྱུར་ནས།
en: The tathāgatas vanished.

source: བྱང་ཆུབ་སེམས་དཔའ་མཛེས་པའི་ཏོག་ཀྱང་སྟན་ལས་ལངས་ནས། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་ཕྱག་འཚལ་ཏེ། སླར་ཡང་རང་གི་གནས་དེ་ཉིད་དུ་འདུག་གོ། །
en: The bodhisattva Ruciraketu rose from his seat, bowed down to the Bhagavat’s feet, and returned to sit in his place.

source: གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་ལས། དེ་བཞིན་གཤེགས་པའི་སྐུ་ཚེའི་ཚད་བསྟན་པ་ཞེས་བྱ་སྟེ་ལེའུ་གཉིས་པའོ།། །།
en: This concludes “The Teaching of the Lifespan of the Tathāgata,” the second chapter of “The Lord King of Sūtras, the Sublime Golden Light.”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནམ་མཁའི་སྙིང་པོ་འཁོར་འདུས་པ་དེའི་ནང་ནས་སྟན་ལས་ལངས་ཏེ། བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས། པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ་ཐལ་མོ་སྦྱར་ནས། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་ལ་ཕྱག་འཚལ་ཏེ།
en: Chapter 3: The Differentiation of the Three Bodies The bodhisattva mahāsattva Ākāśagarbha rose from his seat among that assembly and, with his upper robe over one shoulder, knelt on his right knee, placed his palms together in homage, and bowed to the Bhagavat’s feet.

source: གསེར་དང་རིན་པོ་ཆེའི་མེ་ཏོག་དང་། རིན་པོ་ཆེའི་རྒྱལ་མཚན་དང་། གདུགས་དམ་པས་མཆོད་པ་བྱས་ནས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་དགོངས་པ་ཤིན་ཏུ་ཟབ་པ་དེ། ཚུལ་བཞིན་ཇི་ལྟར་བསྒྲུབ་པར་བགྱི་ཞེས་གསོལ་པ་དང་།
en: He made offerings of flowers made of gold and jewels, precious banners, and sublime parasols, and asked the Bhagavat, “How can the bodhisattva mahāsattvas correctly accomplish the very profound intention of the tathāgatas?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་ལེགས་པར་རབ་ཏུ་ཉོན་ལ་ཡིད་ལ་ཟུང་ཤིག་དང་།
en: The Bhagavat replied, “Noble one, listen and remember!

source: ཁྱོད་ལ་དེའི་དོན་རྣམ་པར་ཕྱེ་སྟེ་བསྟན་པར་བྱའོ། །
en: I will reveal to you its meaning.

source: རིགས་ཀྱི་བུ་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ལ་སྐུ་རྣམ་པ་གསུམ་མངའ་སྟེ།
en: Noble one, all tathāgatas have three kinds of bodies.

source: གསུམ་གང་ཞེ་ན།
en: What are these three?

source: སྤྲུལ་པའི་སྐུ་དང་། ལོངས་སྤྱོད་རྫོགས་པའི་སྐུ་དང་། ཆོས་ཀྱི་སྐུའོ། །
en: They are the emanation body, the perfect enjoyment body, and the Dharma body.

source: འདི་ལྟ་བུ་སྐུ་གསུམ་ལྷུན་གྱིས་གྲུབ་པས། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་འཛིན་ཏེ།
en: Through the spontaneous accomplishment of three such bodies, they possess the highest, most complete enlightenment.

source: གང་གིས་དེ་མངོན་དུ་གྱུར་པ་རྣམས་འཁོར་བ་ལས་འབྱུང་བར་བྱེད་དོ། །
en: Whoever manifests that has emerged from saṃsāra.

source: དེ་ལ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔས་སྤྲུལ་པའི་སྐུ་ཤེས་པར་བྱ་ཞེ་ན།
en: “How should bodhisattvas understand the emanation body?

source: རིགས་ཀྱི་བུ་དེ་ནི་དེ་བཞིན་གཤེགས་པ་སྔོན་ས་རྣམ་པར་སྦྱོང་བའི་དུས་ན། སྐྱེ་བོ་ཐམས་ཅད་ཀྱི་ཕྱིར་ཆོས་རྣམ་པ་སྣ་ཚོགས་སྒྲུབ་བོ། །
en: Noble one, in the past when they were purifying the bhūmis, the tathāgatas practiced all kinds of Dharma for the sake of all beings.

source: དེ་ལྟར་སྤྱོད་པ་སྦྱངས་པས་རྣལ་འབྱོར་གྱི་མཐར་ཕྱིན་པ་ཡིན་ནོ། །
en: Through purifying their conduct in that way, they reached the ultimate conclusion of their practice.

source: རྣལ་འབྱོར་དེའི་སྟོབས་ཀྱིས་དབང་ཆེན་པོ་ཐོབ་བོ། །
en: Through the strength of that practice, they attained great power.

source: དབང་ཆེན་པོའི་མཐུས་སྐྱེ་བོའི་བསམ་པ་ཇི་ལྟ་བ་དང་། སྤྱོད་པ་ཇི་ལྟ་བ་དང་། ཁམས་ཇི་ལྟ་བ་བཞིན་དུ་ཐམས་ཅད་མངོན་དུ་གྱུར་ནས། དུས་ལ་མི་གཞེས་དུས་ལས་མི་འདའ། གནས་དང་མཐུན་པ།
en: Through the might of that great power, they directly perceive the aspirations of beings, their conduct, and their natures, and without engaging in time but always being on time, they manifest various kinds of bodies that are in accord with certain locations that accord with certain times, which accord with certain types of conduct, and accord with certain Dharma teachings.

source: དུས་དང་མཐུན་པ། སྤྱོད་པ་དང་མཐུན་པ། ཆོས་བཤད་པ་དང་ཡང་མཐུན་པར་སྐུ་རྣམ་པ་སྣ་ཚོགས་སྟོན་པ་དེ་ནི་སྤྲུལ་པའི་སྐུ་ཞེས་བྱའོ། །
en: Those are what are called emanation bodies.

source: རིགས་ཀྱི་བུ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔས་ལོངས་སྤྱོད་རྫོགས་པའི་སྐུ་ཤེས་པར་བྱ་ཞེ་ན། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་ཐོགས་པ་མེད་པ་ཐོབ་པར་བྱ་བའི་ཕྱིར།
en: “Noble one, how should bodhisattvas understand the enjoyment body?

source: དོན་དམ་པའི་བདེན་པ་སྟོན་ཏེ། འཁོར་བ་དང་མྱ་ངན་ལས་འདའ་བ་རོ་གཅིག་པ་ཉིད་དུ་ཤེས་པར་བྱ་བ་དང་། འཇིག་ཚོགས་ལ་ལྟ་བ་བསལ་ནས། སེམས་ཅན་འཇིགས་པར་གྱུར་པ་རྣམས་དགའ་བར་བྱ་བ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་མཐའ་ཡས་པའི་རྒྱུར་གྱུར་པས། བདེན་པ་ཉིད་དང་། དེ་བཞིན་ཉིད་ཀྱི་ཡེ་ཤེས་དང་མཐུན་པར་སྔོན་གྱི་སྨོན་ལམ་གྱི་མཐུས།
en: All the tathāgatas, in order to enable bodhisattvas to have unimpeded attainment, in order to teach the ultimate truth so that they would know the one taste of saṃsāra and nirvāṇa, in order to dispel the view of belief in a self, and in order to make terrified beings become happy, in accord with truth and with the wisdom of the true nature—which are the cause of the infinite qualities of the buddhas—and through the power of past prayers, they manifest bodies that are beautified by the thirty-two signs and eighty features of a great being, with auras of light around their bodies.

source: སྐུ་དེ་སྟོན་པར་འགྱུར་ཏེ། མཚན་སུམ་ཅུ་རྩ་གཉིས་དང་། དཔེ་བྱད་བཟང་པོ་བརྒྱད་ཅུས་བརྒྱན་པ།
en: Those are called the enjoyment bodies.

source: འོད་སྐུ་ལ་འཁོར་བ་གྲུབ་པ་དེ་ནི་ལོངས་སྤྱོད་རྫོགས་པའི་སྐུ་ཞེས་བྱའོ། །རིགས་ཀྱི་བུ་དེ་ལ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཆོས་ཀྱི་སྐུ་ཤེས་པར་བྱ་ཞེ་ན།
en: “Noble one, how should bodhisattva mahāsattvas understand the Dharma body?

source: ཉོན་མོངས་པའི་སྒྲིབ་པ་ཐམས་ཅད་དང་བྲལ་བ། དགེ་བའི་ཆོས་ཐམས་ཅད་རྫོགས་པའི་ཕྱིར། དེ་ཁོ་ན་ཉིད་དང་ཡང་དག་པའི་ཡེ་ཤེས་ཉིད་ཙམ་དུ་གནས་པ། དེ་ནི་ཆོས་ཀྱི་སྐུ་ཞེས་བྱའོ། །
en: Solely remaining in the true nature and in valid wisdom, in order to be free of all the kleśa obscurations and to have a perfection of good qualities, is what is called the Dharma body.

source: སྐུ་སྔ་མ་དེ་གཉིས་ནི་བཏགས་པ་ཙམ་མོ། །ཆོས་ཀྱི་སྐུ་ནི་ཡང་དག་པ་སྟེ། སྐུ་དེ་གཉིས་ཀྱི་གཞི་བྱེད་དོ། །
en: “The first two bodies are merely designations, while the Dharma body is true and the basis for those two other bodies.

source: ཆོས་ཀྱི་སྐུ་དེ་བཞིན་ཉིད་དང་། རྣམ་པར་མི་རྟོག་པའི་ཡེ་ཤེས་ལས་གུད་ན་སངས་རྒྱས་རྣམས་ཀྱི་ཆོས་གང་ཡང་མེད་པའི་ཕྱིར་རོ། །
en: It is because there are no other qualities of buddhahood separate from the Dharma body, the true nature, and nonconceptual wisdom.

source: དེ་བཞིན་གཤེགས་པ་རྣམས་ནི་ཡེ་ཤེས་ཕུན་སུམ་ཚོགས་པ་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་པའི་ཕྱིར་མཐར་ཕྱིན་པས།
en: The tathāgatas have reached the ultimate conclusion because of consummate wisdom and the elimination of all kleśas.

source: སངས་རྒྱས་ཀྱི་རྣམ་པར་དག་པ་བརྙེས་པའི་ཕྱིར་ཆོས་ཀྱི་དེ་ཁོ་ན་ཉིད་དང་ཡང་དག་པའི་ཡེ་ཤེས་ཀྱི་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ཡོངས་སུ་འཛིན་ཏོ། །
en: Thereby, they have attained the purity of buddhahood, and so they possess all the buddha qualities of the true nature and valid wisdom.

source: གཞན་ཡང་རིགས་ཀྱི་བུ་སངས་རྒྱས་ཐམས་ཅད་ནི་བདག་དང་གཞན་གྱི་དོན་གྱི་མཐར་ཕྱིན་པ་སྟེ། དེ་ལ་ཆོས་ཀྱི་དེ་བཞིན་ཉིད་ཀྱིས་ནི་བདག་གི་དོན་མཛད། དེ་བཞིན་ཉིད་ཀྱི་ཡེ་ཤེས་ཀྱིས་ནི་གཞན་གྱི་དོན་མཛད་དོ། །
en: “Moreover, noble one, all buddhas have reached the ultimate conclusion of benefiting themselves and others: the benefit for themselves is accomplished through the true nature of phenomena, and benefit for others is accomplished through the wisdom of the true nature.

source: བདག་དང་གཞན་ལ་ཕན་པའི་དོན་མཛད་པ་ལ་དབང་བརྙེས་པའི་ཕྱིར་མཛད་པ་མཐའ་ཡས་པ་སྣ་ཚོགས་ལྷུན་གྱིས་གྲུབ་བོ། །
en: Because they have attained the power to benefit themselves and others, there is a spontaneous accomplishment of infinite deeds.

source: དེ་བས་ན་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཆོས་དཔག་ཏུ་མེད་པ་མཐའ་ཡས་པ། རྣམ་པ་མང་པོ་ཁྱད་པར་དུ་བསྟན་ཏོ། །རིགས་ཀྱི་བུ་དཔེར་ན་རྣམ་པར་རྟོག་པའི་སེམས་ལ་བརྟེན་ནས། ཉོན་མོངས་པ་རྣམ་པ་མང་པོ་དང་། ལས་རྣམ་པ་མང་པོ་དང་།
en: Therefore, they specifically reveal the endless, countless kinds of qualities of all the buddhas.

source: འབྲས་བུ་རྣམ་པ་མང་པོ་སྟོན་པ་དེ་བཞིན་དུ། ཆོས་ཀྱི་ཆོས་ཉིད་དང་དེ་བཞིན་ཉིད་ཀྱི་ཡེ་ཤེས་ལ་བརྟེན་ནས། སངས་རྒྱས་ཀྱི་ཆོས་རྣམ་པ་སྣ་ཚོགས་དང་། རང་སངས་རྒྱས་ཀྱི་ཆོས་རྣམ་པ་སྣ་ཚོགས་དང་། ཉན་ཐོས་ཀྱི་ཆོས་རྣམ་པ་སྣ་ཚོགས་མང་པོ་སྟོན་ཏོ། །
en: “As an analogy, noble one, on the basis of a conceptual mind there are manifested many kleśas, many actions, and many results; in the same way, on the basis of the true nature of phenomena and the wisdom of the true nature, there are manifested the various kinds of qualities of the buddhas, the various kinds of qualities of the pratyekabuddhas, and the various kinds of qualities of the śrāvakas.

source: ཆོས་ཀྱི་དེ་བཞིན་ཉིད་དང་། དེ་བཞིན་ཉིད་ཀྱི་ཡེ་ཤེས་ལ་བརྟེན་ནས། སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཆོས་ལ་དབང་ཕུན་སུམ་ཚོགས་པ་བརྙེས་པ་དེ་ནི་དམ་པ་དཔག་པར་དཀའ་བ་ཡིན་ནོ། །
en: “On the basis of the true nature of phenomena and the wisdom of the true nature, there is the attainment of the perfect power of the qualities of buddhahood, which are sublime and impossible to comprehend.

source: དཔེར་ན་ནམ་མཁའ་ལ་རི་མོ་བྲིས་ཏེ། རྒྱན་དུ་བྱས་པ་དེ་ནི་དཔག་པར་དཀའ་བ་ཡིན་ནོ། །དེ་བཞིན་དུ་ཡང་དག་པའི་ཆོས་དང་། ཡང་དག་པའི་ཡེ་ཤེས་ལ་བརྟེན་ནས། སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་བསྒྲུབ་པ་ཡང་དཔག་པར་དཀའ་བ་ཡིན་ནོ། །
en: As an analogy, painting and adorning the sky is impossible to comprehend; in the same way, the accomplishment of the qualities of buddhahood on the basis of the true nature of phenomena and the wisdom of the true nature is impossible to comprehend.

source: རིགས་ཀྱི་བུ་ཇི་ལྟར་ན། ཆོས་ཀྱི་དེ་བཞིན་ཉིད་དང་། དེ་བཞིན་ཉིད་ཀྱི་ཡེ་ཤེས་ལ་རྣམ་པར་རྟོག་པ་མི་མངའ་ཞིང་། ཕྲིན་ལས་ལ་མངའ་བརྙེས་པ་ཡིན་ཞེ་ན།
en: “Noble one, how is it that there is the attainment of the possession of activity when there is no possession of conceptualization in the true nature of phenomena and in the wisdom of the true nature?

source: རིགས་ཀྱི་བུ་དཔེར་ན་དེ་བཞིན་གཤེགས་པ་མྱ་ངན་ལས་འདས་ཀྱང་སྨོན་ལམ་ལ་མངའ་བརྙེས་པས་ཕྲིན་ལས་ཀྱི་རྣམ་པ་ཐམས་ཅད་ཀྱང་མཛད་དེ།
en: “As an analogy, noble one, although the tathāgatas pass into nirvāṇa, it is through the attainment of the possession of prayer that they accomplish all the various kinds of activities.

source: དེ་བཞིན་ཉིད་དང་། དེ་བཞིན་ཉིད་ཀྱི་ཡེ་ཤེས་ཀྱིས་དོན་ཐམས་ཅད་གྲུབ་པར་མངའ་མཛད་པའང་དེ་བཞིན་ནོ། །
en: In that same way, the true nature and the wisdom of the true nature possess the accomplishment of all benefits.

source: གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཏིང་ངེ་འཛིན་དུ་སྙོམས་པར་ཞུགས་པ་ལས་སྔོན་གྱི་སྨོན་ལམ་གྱི་དབང་གིས། བསམ་གཏན་དེ་ལས་བཞེངས་ཏེ།
en: “Moreover, through the power of their previous prayers, the bodhisattva mahāsattvas who are resting in samādhi arise from that meditation and accomplish all benefits and activities.

source: དོན་དང་ཕྲིན་ལས་ཐམས་ཅད་མཛད་པ་ལྟར་ཆོས་རྣམ་པ་གཉིས་ཀྱང་རྣམ་པར་རྟོག་པ་མེད་པར་དོན་ཐམས་ཅད་མཛད་པ་ལ་མངའ་བརྙེས་པའོ། །རིགས་ཀྱི་བུ་དཔེར་ན།
en: In that way, both the true nature and the wisdom of the true nature have the accomplishment, without conceptualization, of all benefits.

source: ཉི་མ་དང་། ཟླ་བ་ལ་ཡང་རྣམ་པར་རྟོག་པ་མེད། ཆུ་དང་མེ་ལོང་ལ་ཡང་རྣམ་པར་རྟོག་པ་མེད། སྣང་བ་ལ་ཡང་རྣམ་པར་རྟོག་པ་མེད་མོད་ཀྱི། གསུམ་འདུས་པ་ལས་གཟུགས་བརྙན་འབྱུང་ངོ་། །
en: “As an analogy, noble one, the sun and moon have no thoughts, water and mirrors have no thoughts, and light has no thoughts, yet through the combination of these three, there appear reflections.

source: དེ་བཞིན་དུ་ཆོས་ཀྱི་དེ་བཞིན་ཉིད་དང་། དེ་བཞིན་ཉིད་ཀྱི་ཡེ་ཤེས་ལ་ཡང་རྣམ་པར་རྟོག་པ་མེད་མོད་ཀྱི། སྨོན་ལམ་གྱི་དབང་གིས་སེམས་ཅན་སྐལ་བ་ཅན་དག་ལ་ལོངས་སྤྱོད་རྫོགས་པའི་སྐུ་དང་། སྤྲུལ་པའི་སྐུ་ཡང་ཉི་ཟླའི་གཟུགས་བརྙན་བཞིན། རྒྱུ་དང་རྐྱེན་འདུས་པ་ལས་འབྱུང་ངོ་། །
en: In the same way, there are no thoughts in the true nature of phenomena and the wisdom of the true nature, yet through the power of prayer, like the reflections of the sun and moon, there arise for worthy beings, through causes and conditions, the enjoyment bodies and the emanation bodies.

source: རིགས་ཀྱི་བུ་གཞན་ཡང་དཔེར་ན། ཚད་མེད་གྲངས་མེད་པའི་ཆུ་དང་མེ་ལོང་དག་ནི་སྣང་བ་ལ་བརྟེན་ནས། སྟོང་པའི་གཟུགས་བརྙན་མཚན་ཉིད་ཐ་དད་པ་དག་སྣང་ངོ་། །སྟོང་པ་ཞེས་བྱ་བ་ནི་མཚན་ཉིད་མེད་པའོ། །
en: “Also, noble one, there is the analogy of countless, innumerable waters and mirrors, in which appear the different characteristics of empty reflections because of light, even though empty means ‘devoid of characteristics.’
